[{
        "title": "A Year on the Bus",
        "author": "Dan Close",
        "ISBN": "978-0-9706620-2-6",
        "contentBlurb": "Close tells us that, on any given day in the United States of America, there are approximately 480,000 school buses on our roads. They transport 26-million students to schools and events.\nThis is the story of one bus driver’s first year driving a bus named \"Phil.\" It was full of a feisty band of students ranging from pre-schoolers to high-schoolers. These are your children, America, and this is an epic story of A Year on the Bus.",
        "coverFilename": "Close-AYearontheBusCover.jpg",
        "merchantLinks" : [
            {
                "name" : "Amazon",
                "link" : "https://www.amazon.com/Year-Bus-Dan-Close-ebook/dp/B0129XU4QA/ref=sr_1_1?crid=3QSYPPOPS51FE&keywords=Dan+Close%2C+A+Year+on+the+Bus&qid=1642103244&sprefix=dan+close%2C+a+year+on+the+bus%2Caps%2C67&sr=8-1"
            },
            {
                "name" : "Indie Bound",
                "link" : "https://www.indiebound.org/search/book?keys=A+Year+On+the+Bus"
            }
        ]
    },
    {
        "title": "Song of Quebec",
        "author": "Dan Close",
        "ISBN": "978-0-9907792-2-3",
        "contentBlurb": "When American Jack Kearney hears Genevieve St. Andre singing in the streets of Quebec City in the mid-twentieth-Century, he is enthralled by her beauty and is determined to meet her. But Kearney’s special mission to Quebec must remain secret. And Genevieve has secrets of her own to protect.\nJack and Genevieve’s adventures during this tumultuous period—and their involvement with events surrounding the province’s struggle with issues of independence from Canada, or continuation within the Commonwealth—are played out against the background of the grand French-inspired Quebec City, where danger lurks, international intrigue is afoot, and the unexpected is ever-present.",
        "coverFilename": "Close-SongOfQuebec.jpg",
        "merchantLinks" : [
            {
                "name" : "Amazon",
                "link" : "https://www.amazon.com/Song-Quebec-Dan-Close/dp/099077922X/ref=sr_1_1?crid=11QNVDR95ZCAH&keywords=Dan+Close%2C+Song+of+Quebec&qid=1642103513&sprefix=dan+close%2C+song+of+quebec%2Caps%2C67&sr=8-1"
            },
            {
                "name" : "Indie Bound",
                "link" : "https://www.indiebound.org/search/book?keys=Song+of+Quebec"
            }
        ]
    },
    {
        "title": "The Glory of the Kings",
        "author": "Dan Close",
        "ISBN": "978-0-9706620-4",
        "contentBlurb": "The year is 1896. The European colonizing effort known as \"The Scramble for Africa\" is at its peak. Against the threat of invasion, Ethiopean Emperor Menelik II, King of Kings, Conquering Lion of the Tribe of Judah, issues a proclamation of war and rallies his people to the defense of The Motherland.\nTwo brothers, Bedane and Chala Negassa, answer the call. One leads a squadron of fierce cavalry into battle; the other is assigned to guide a priest, the Bishop of Ba’le Province, northward toward the battle to pray for their people’s success.\nThe story takes readers along with the brothers during a time when Menelik opposed an invasion by Italian troops, an era that culminated in the historic Battle of Adua, in which the Ethiopeans defeated the invaders.",
        "coverFilename": "Close-TheGlory of the Kings cover.jpg",
        "merchantLinks" : [
            {
                "name" : "Amazon",
                "link" : "https://www.amazon.com/Glory-Kings-Dan-Close-ebook/dp/B0129WGGB8/ref=sr_1_1?crid=2VV1T81IP7Z7N&keywords=Dan+Close%2C+The+Glory+of+the+Kings&qid=1642103338&sprefix=dan+close%2C+the+glory+of+the+kings%2Caps%2C69&sr=8-1"
            },
            {
                "name" : "Indie Bound",
                "link" : "https://www.indiebound.org/search/book?keys=The+Glory+of+the+Kings"
            }
        ]
    },
    {
        "title": "What the Abenaki Say About Dogs",
        "author": "Dan Close",
        "ISBN": "ISBN: 978-0-9206620-1-9",
        "contentBlurb": "Commemorating the 400th Anniversary of Samuel de Champlain’s arrival on The Waters that Lie Between - Lake Champlain - Dan Close writes a collection of poetic narratives about the land alongside the lake—land now known mostly as Vermont. In tales seen through his eyes, Close imagines how it might have been before de Champlain \"found\" the lake and brought Europeans to its shore. The poet tells many tales of old and more modern times beside the water, closing out his collection with a whimsical and heartfelt short story about The Bold McGregor, a man of deep thoughts and many mysteries \n…Several members of the Vermont Abenaki tribe have embraced the book and sold it in their shops.",
        "coverFilename": "Close-WhattheAbenakeSayAboutDogsCover.jpg",
        "merchantLinks" : [
            {
                "name" : "Amazon",
                "link" : "https://www.amazon.com/What-Abenaki-Say-About-Dogs/dp/0970662017/ref=sr_1_1?crid=NF1VS2LLI862&keywords=What+the+Abenaki+Say+About+Dogs&qid=1642102684&sprefix=what+the+abenaki+say+about+dogs%2Caps%2C74&sr=8-1"
            },
            {
                "name" : "Indie Bound",
                "link" : "https://www.indiebound.org/search/book?keys=What+the+Abenaki+Say+About+Dogs"
            }
        ]
    },
    {
        "title": "The Carnie Kid Tells All",
        "author": "Ilan Fisher",
        "ISBN": "978-0-9706620-0-2",
        "contentBlurb": "Ilan Fisher’s anthology of columns printed in the Sharon Advocate newspaper in the 1980s and ‘90s chronicle his life growing up in the small-town atmosphere and culturally-evolving suburb south of Boston. Told with wit and insight, tales of childhood, family, community, and politics abound, offering one man’s bright and revealing look into the world of Sharon, Massachusetts, as the 20th Century matured and approached the end of a Millennium.",
        "coverFilename": "Fisher-TheCarnieKidTellsAllCover-Fr-Tamarac-2002.jpg",
        "purchaseNotes": "Purchase through The Tamarac Press: <a href=\"nnobrien@gmail.com\">nnobrien@gmail.com</a>"
    },
    {
        "title": "Incident at St Albans",
        "author": "Ted Tedford",
        "ISBN": "978-0-9907792-0-9",
        "contentBlurb": "In the northernmost land action of the American Civil War, twenty-one Confederate soldiers led by a young Kentucky lieutenant staged a raid on the town of St. Albans, Vermont. They robbed banks, shot citizens, and stole horses to make their escape to Canada. This fictionalized history of that raid deals with the life and escapades of their leader, Lieutenant Bennett H. Young, who conceived of and carried off the raid. We see Young's life before the raid and follow the exploits of the Raiders as they ride off to Canada, where they faced legal battles and trial after trial, with their lives in the balance.",
        "coverFilename": "Tedford- IncidentAtStAlbans cover.jpg",
        "merchantLinks": [{
                "name": "Amazon",
                "link": "https://www.amazon.com/Incident-St-Albans-Ted-Tedford/dp/0990779203/ref=sr_1_1?crid=1GTMP6FHC0GQL&keywords=Incident+at+St.+Albans&qid=1642103689&s=books&sprefix=incident+at+st.+albans%2Cstripbooks%2C74&sr=1-1"
            },
            {
                "name": "Indie Bound",
                "link": "https://www.indiebound.org/search/book?keys=Incident+at+St.+Albans"
            }
        ]
    },
    {
        "title": "Nanny Goat Hill",
        "author": "Marie Flaim Tedford",
        "ISBN": "978-0-9907792-3-0",
        "contentBlurb": "This short story collection introduces the world of Nanny Goat Hill in northern New Jersey during the 1920s and ‘30s, as seen through the eyes of young Maria, who observes the world around her and thinks too much about boys, nuns, sickness, death, romance, prejudice, and her big, sprawling Italian family, their boarders, step-parents, Irish and German neighbors, and assorted eccentric relatives and friends. \nSome of the stories are almost true.",
        "coverFilename": "Tedford-NannyGoatHill cover.png",
        "merchantLinks": [
            {
                "name": "Amazon",
                "link": "https://www.amazon.com/Nanny-Goat-Marie-Flaim-Tedford/dp/0990779238/ref=sr_1_1?crid=B6E8AYUX1064&keywords=Nanny+Goat+Hill&qid=1642103649&s=books&sprefix=nanny+goat+hill%2Cstripbooks%2C78&sr=1-1"
            },
            {
                "name": "Indie Bound",
                "link": "https://www.indiebound.org/search/book?keys=Nanny+Goat+Hill"
            }
        ]
    }
]